# HvacTemperatureDifference Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..HvacTemperatureDifference Property
SpecTypeId Class See Also
---
Temperature Difference, in discipline HVAC.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId HvacTemperatureDifference { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property HvacTemperatureDifference As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ HvacTemperatureDifference {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace